# Compare Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ElementId..::..Compare Method
ElementId Class See Also
---
Compares two element ids.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public int Compare(
	ElementId id
)
```

Visual Basic
---
```text
Public Function Compare ( _
	id As ElementId _
) As Integer
```

Visual C++
---
```text
public:
int Compare(
	ElementId^ id
)
```

# ### Parameters
id
    Type: Autodesk.Revit.DB..::..ElementIdThe ElementId to be compared with this ElementId.
# ### Return Value
-1 if this element id is less than id, 0 if equal, 1 if greater.
# See Also
ElementId Class
Autodesk.Revit.DB Namespace